src/systemtest/op-monitoring/xrd-opmon-tests/templates/query_health_data_producer_template.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
        xmlns:om="http://x-road.eu/xsd/op-monitoring.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <xroad:client id:objectType="SUBSYSTEM">
            <id:xRoadInstance>{params[producer_instance]}</id:xRoadInstance>
            <id:memberClass>{params[producer_class]}</id:memberClass>
            <id:memberCode>{params[producer_code]}</id:memberCode>
            <id:subsystemCode>{params[producer_system]}</id:subsystemCode>
        </xroad:client>
        <xroad:service id:objectType="SERVICE">
            <id:xRoadInstance>{params[producer_instance]}</id:xRoadInstance>
            <id:memberClass>{params[producer_class]}</id:memberClass>
            <id:memberCode>{params[producer_code]}</id:memberCode>
           <id:serviceCode>getSecurityServerHealthData</id:serviceCode>
        </xroad:service>
        <xroad:id>{message_id_placeholder}</xroad:id>
        <xroad:protocolVersion>4.0</xroad:protocolVersion>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
       <om:getSecurityServerHealthData>
            <om:filterCriteria>
                <om:client id:objectType="SUBSYSTEM">
                    <id:xRoadInstance>{params[producer_instance]}</id:xRoadInstance>
                    <id:memberClass>{params[producer_class]}</id:memberClass>
                    <id:memberCode>{params[producer_code]}</id:memberCode>
                    <id:subsystemCode>{params[producer_system]}</id:subsystemCode>
                </om:client>
            </om:filterCriteria>
        </om:getSecurityServerHealthData>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
